[
  {
    "name": "Smart Dust",
    "desc": "Smart dust is a tiny wireless microelectromechanical sensor (MEMS) that can detect conditions such as light, vibration, temperature and noise, and autonomously communicate this information back to a receiver. Smart dust has many potential applications, including military, medical, and environmental monitoring. Smart dust is still in its early stages of development, but it has the potential to revolutionize many industries.",
    "image": "assets/images/projects/SmartDust.png",
    "category": "",
    "links": {
      "view": "https://prezi.com/p/ggtrlopo5gcd/smart-dust-mems/"
    }
  },
  {
    "name": "E-Waste",
    "desc": "The project discusses the dangers of electronic waste and the importance of managing it properly. E-waste is any discarded electrical or electronic device, and it can be harmful to both the environment and human health. The presentation provides statistics on the amount of e-waste generated each year and the types of devices that make up e-waste. It also discusses the effects of e-waste on the environment, including soil pollution, water pollution, and air pollution. The presentation also discusses the effects of e-waste on human health, including lead poisoning, mercury poisoning, and cadmium poisoning.",
    "image": "assets/images/projects/EWaste.png",
    "category": "",
    "links": {
      "view": "https://prezi.com/p/kehwckggk619/e-waste/"

    }
  },
  {
    "name": "Laser Beam Machining",
    "desc": "Laser Beam Machining (LBM) is a non-conventional machining method that utilizes the thermal energy of a focused laser beam to remove material from a workpiece. This process is suitable for machining both metallic and non-metallic materials, particularly those with low conductivity or brittle properties. LBM operates by directing a high-frequency monochromatic light beam onto the workpiece surface, causing the material to heat, melt, and vaporize. LBM finds applications in various industries, including light and heavy manufacturing, electronics, and medical device production.",
    "image": "assets/images/projects/LBM.png",
    "category": "",
    "links": {
      "view": "https://prezi.com/p/cfnked8cj8qt/laser-beam-machining/"
    }
  },
  {
    "name": "Successful Career",
    "desc": "Successful Career highlights the significance of career planning and its positive outcomes. Emphasizes the importance of self-satisfaction, setting higher goals, and demonstrating a strong degree of commitment. The value of community contribution, citing examples of successful individuals like Nicolas Tesla, Elon Musk, Alfred Nobel, Mikhail Kalashnikov, APJ Abdul Kalam, and Steve Jobs. To conclude by emphasises the lasting impact of a successful career on future generations, leading to satisfaction and recognition.",
    "image": "assets/images/projects/SuccessfulCareer.png",
    "category": "",
    "links": {
      "view": "https://prezi.com/p/rlsgrvh9bimj/successful-career/"
    }
  },
  {
    "name": "Financial Management",
    "desc": "This presentation provides an overview of financial management concepts, including terminology, financial statements, and ratio analysis. It also includes a case study of Konkan Textiles, a company that is seeking a loan from a bank to finance a new factory building. The presentation concludes with a discussion of the company's solvency and liquidity positions, as well as its claim that all of its expenditure on fixed assets during the previous year was financed entirely by its own funds.",
    "image": "assets/images/projects/FinancialManagement.png",
    "category": "",
    "links": {
      "view": "https://prezi.com/p/xbuljlsw3d6w/financial-management/"
    }
  },
  {
    "name": "Smart Phones",
    "desc": "This project discusses the problems faced by smartphones and their solutions. The problems faced are low battery capacity, breaking of smartphones, performance slowdown, poor camera quality, high screen-body ratio, notches, and large screen-small form factor. The solutions proposed are the use of hot-swappable power banks, screen protectors, polycarbonate covers, graphene, sapphire, and various display solutions like foldable phones, pinhole, and duel screens.",
    "image": "assets/images/projects/SmartPhones.png",
    "category": "",
    "links": {
      "view": "https://prezi.com/p/ezbtdhvpnbwc/smart-phones/"
    }
  },
  {
    "name": "Autonomous Robotic Harvesting System",
    "desc": "The project involved presenting a comprehensive proposal for the development, prototyping, and simulation of a novel inflatable end-effector designed to efficiently harvest round or pseudo-round shaped produce. The key focus was on ensuring the feasibility of integrating this innovative tool with widely available robotic platforms. To achieve this, the team conducted rigorous kinematic and dynamic analyses to validate the compatibility and practicality of the proposed end-effector. By addressing the technical aspects and demonstrating its potential for seamless integration, the project contributes to advancing automated harvesting processes in agriculture.",
    "image": "ARHS",
    "category": "",
    "links": {
      "view": "",
      "code": ""
    }
  },
  {
    "name": "Intuitive Control of Virtual Globe Using Vision-Based Hand Tracking System    ",
    "desc": "This project proposes a novel method for controlling a virtual globe using hand gestures. The proposed method utilizes the MediaPipe library for hand tracking and the Perspective-n-Point (PnP) method for 3D pose estimation. The system tracks the user's hand position and gestures and maps these movements to corresponding actions on the virtual globe. This allows for a more intuitive and engaging way to interact with virtual globes, compared to traditional methods such as a mouse or touchscreen. The paper also presents experimental results that demonstrate the accuracy and robustness of the proposed method.",
    "image": "ICVGVBHTS",
    "category": "",
    "links": {
      "view": "",
      "code": ""
    }
  },
  {
    "name": "Flipkart GRiD 2.0 - Robotics Hackathon",
    "desc": "A five-member team collaborated on a project to develop a proof of concept and build a proposal for an autonomous smart indoor drone that could carry 5 lbs of payload and automate warehouse management tasks. The drone would use sensors like cameras and lidar to navigate safely and efficiently. The team presented a comprehensive proposal with a detailed design, testing plan, budget, and timeline. This project has the potential to revolutionize warehouse management by automating tasks, reducing costs, increasing fulfilment capacity, and working 24/7.",
    "image": "FGRH",
    "category": "",
    "links": {
      "view": "",
      "code": ""
    }
  },
  {
    "name": "Miniature Paper Printing Machine",
    "desc": "A functional miniature paper printing machine was constructed using Meccano sheet metal components, applying the principles of Kinematics & Dynamics of Machines coursework. The machine effectively transfers ink from a printing plate onto paper, demonstrating a successful implementation of mechanical engineering concepts.",
    "image": "MPPM",
    "category": "",
    "links": {
      "view": "",
      "code": ""
    }
  },
  {
    "name": "Smart Areal Robot",
    "desc": "Smart Areal Robot is a project that is creating a sophisticated robot that can follow lines, detect edges, be controlled by Bluetooth, and avoid obstacles. The project is being done on a $100 budget, which shows that it is possible to create a robot with these features without spending a lot of money.",
    "image": "SAR",
    "category": "",
    "links": {
      "view": "",
      "code": ""
    }
  },
  {
    "name": "A Generic Solver for Forward Kinematics of Single Degree-of-Freedom 4-bar and 6-bar Planar Linkages",
    "desc": "This project developed a graphical user interface (GUI) application on the .NET framework that integrates multiple self-authored dynamic-link libraries to perform forward kinematic analysis of any single degree of freedom planar mechanisms. The GUI application reduces computational time by 30% and enables engineers to perform forward kinematic analysis simply by drawing the joint map on a blank canvas.",
    "image": "AGSFKSDPL",
    "category": "",
    "links": {
      "view": "",
      "code": ""
    }
  },
  {
    "name": "Automated Workflow of Additive and Subtractive Manufactured Parts",
    "desc": "This project explored an automated workflow for fabricating custom-designed components using both additive and subtractive manufacturing techniques. By generating G-code and simulating the CNC subtractive manufacturing process. Additionally, a comprehensive pipeline was developed for selecting the optimal additive manufacturing technique based on material properties, design geometry, production size, and desired accuracy levels. This project highlights the potential of combining additive and subtractive manufacturing techniques to achieve efficient and precise manufacturing of custom-designed components.",
    "image": "AWASMP",
    "category": "",
    "links": {
      "view": "",
      "code": ""
    }
  },
  {
    "name": "Portfolio Website",
    "desc": "Personal Portfolio Website. Don't Need Much Info About It, Just Scroll Down. You're Here Only!",
    "image": "portfolio",
    "category": "",
    "links": {
      "view": "#",
      "code": "https://vaishnavch.github.io/Portfolio/"
    }
  },
  {
    "name": "Tribometer",
    "desc": "Simple landing page website built using HTML, CSS, JavaScript and some JavaScript Libraries.",
    "image": "composey",
    "category": "basicweb",
    "links": {
      "view": "",
      "code": ""
    }
  },
  {
    "name": "Intuitive & Counter-Intuitive Mechanisms",
    "desc": "It's an android app which uses web view component for displaying content. This app provides many different features.",
    "image": "webviewapp",
    "category": "android",
    "links": {
      "view": "",
      "code": ""
    }
  }
]
